In [111]:
import numpy as np
import pandas as pd

In [112]:
df=pd.read_csv("Downloads/Data.csv")

In [113]:
df.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [114]:
X=df.iloc[:,[0,1,3]]

In [115]:
y=df.iloc[:,2]

In [116]:
X.shape, y.shape

((10, 3), (10,))

In [117]:
X['Country'].value_counts()

France     4
Spain      3
Germany    3
Name: Country, dtype: int64

In [118]:
Encoded_Country=pd.get_dummies(X.Country,drop_first=True)

In [119]:
Encoded_Country

   Germany  Spain
0        0      0
1        0      1
2        1      0
3        0      1
4        1      0
5        0      0
6        0      1
7        0      0
8        1      0
9        0      0

In [120]:
Encoded_Purchased=pd.get_dummies(X.Purchased,drop_first=True)

In [121]:
X=pd.concat([X,Encoded_Country,Encoded_Purchased],axis=1)

In [122]:
X

   Country   Age Purchased  Germany  Spain  Yes
0   France  44.0        No        0      0    0
1    Spain  27.0       Yes        0      1    1
2  Germany  30.0        No        1      0    0
3    Spain  38.0        No        0      1    0
4  Germany  40.0       Yes        1      0    1
5   France  35.0       Yes        0      0    1
6    Spain   NaN        No        0      1    0
7   France  48.0       Yes        0      0    1
8  Germany  50.0        No        1      0    0
9   France  37.0       Yes        0      0    1

In [123]:
X=X.drop(['Country','Purchased'],axis=1)

In [124]:
X.rename({'Germany':"Country1","Spain":"Country2","Yes":"Purchased"},axis=1,inplace=True)

In [125]:
X

    Age  Country1  Country2  Purchased
0  44.0         0         0          0
1  27.0         0         1          1
2  30.0         1         0          0
3  38.0         0         1          0
4  40.0         1         0          1
5  35.0         0         0          1
6   NaN         0         1          0
7  48.0         0         0          1
8  50.0         1         0          0
9  37.0         0         0          1

In [126]:
X.isnull().sum()

Age          1
Country1     0
Country2     0
Purchased    0
dtype: int64

In [127]:
y.isnull().sum()

1

In [128]:
X.fillna(X.mean(),inplace=True)

In [129]:
y.fillna(y.mean(),inplace=True)

In [130]:
from sklearn.model_selection import train_test_split

In [131]:
x_train,x_test,y_train,y_test=train_test_split(X,y,test_size=0.2,random_state=0)

In [132]:
x_train.shape,x_test.shape

((8, 4), (2, 4))

In [134]:
from sklearn.linear_model import LinearRegression

In [135]:
lr=LinearRegression()

In [136]:
lr.fit(x_train,y_train)

LinearRegression()

In [137]:
y_pred=lr.predict(x_test)

In [140]:
y_pred.round(2)

array([47711.45, 73097.75])

In [139]:
y_test

2    54000.0
8    83000.0
Name: Salary, dtype: float64

In [141]:
lr.score(x_test,y_test)

0.6727694940667104